MikroElektronika/core_packages/PIC/XC8/def/PIC18F14K50/mcu.h
extern volatile SSPMASKbits_t SSPMASKbits __at(0xF6F);
// bitfield macros
#define _SSPMASK_MSK_POSN                                   0x0
#define _SSPMASK_MSK_POSITION                               0x0
#define _SSPMASK_MSK_SIZE                                   0x8
#define _SSPMASK_MSK_LENGTH                                 0x8
#define _SSPMASK_MSK_MASK                                   0xFF
#define _SSPMASK_MSK0_POSN                                  0x0
#define _SSPMASK_MSK0_POSITION                              0x0
#define _SSPMASK_MSK0_SIZE                                  0x1
#define _SSPMASK_MSK0_LENGTH                                0x1
#define _SSPMASK_MSK0_MASK                                  0x1
#define _SSPMASK_MSK1_POSN                                  0x1
#define _SSPMASK_MSK1_POSITION                              0x1
#define _SSPMASK_MSK1_SIZE                                  0x1
#define _SSPMASK_MSK1_LENGTH                                0x1
#define _SSPMASK_MSK1_MASK                                  0x2
#define _SSPMASK_MSK2_POSN                                  0x2
#define _SSPMASK_MSK2_POSITION                              0x2
#define _SSPMASK_MSK2_SIZE                                  0x1
#define _SSPMASK_MSK2_LENGTH                                0x1
#define _SSPMASK_MSK2_MASK                                  0x4
#define _SSPMASK_MSK3_POSN                                  0x3
#define _SSPMASK_MSK3_POSITION                              0x3
#define _SSPMASK_MSK3_SIZE                                  0x1
#define _SSPMASK_MSK3_LENGTH                                0x1
#define _SSPMASK_MSK3_MASK                                  0x8
#define _SSPMASK_MSK4_POSN                                  0x4
#define _SSPMASK_MSK4_POSITION                              0x4
#define _SSPMASK_MSK4_SIZE                                  0x1
#define _SSPMASK_MSK4_LENGTH                                0x1
#define _SSPMASK_MSK4_MASK                                  0x10
#define _SSPMASK_MSK5_POSN                                  0x5
#define _SSPMASK_MSK5_POSITION                              0x5
#define _SSPMASK_MSK5_SIZE                                  0x1
#define _SSPMASK_MSK5_LENGTH                                0x1
#define _SSPMASK_MSK5_MASK                                  0x20
#define _SSPMASK_MSK6_POSN                                  0x6
#define _SSPMASK_MSK6_POSITION                              0x6
#define _SSPMASK_MSK6_SIZE                                  0x1
#define _SSPMASK_MSK6_LENGTH                                0x1
#define _SSPMASK_MSK6_MASK                                  0x40
#define _SSPMASK_MSK7_POSN                                  0x7
#define _SSPMASK_MSK7_POSITION                              0x7
#define _SSPMASK_MSK7_SIZE                                  0x1
#define _SSPMASK_MSK7_LENGTH                                0x1
#define _SSPMASK_MSK7_MASK                                  0x80

// Register: SLRCON
#define SLRCON SLRCON
extern volatile unsigned char           SLRCON              __at(0xF76);
#ifndef _LIB_BUILD
asm("SLRCON equ 0F76h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRA                   :1;
        unsigned SLRB                   :1;
        unsigned SLRC                   :1;
    };
} SLRCONbits_t;
extern volatile SLRCONbits_t SLRCONbits __at(0xF76);
// bitfield macros
#define _SLRCON_SLRA_POSN                                   0x0
#define _SLRCON_SLRA_POSITION                               0x0
#define _SLRCON_SLRA_SIZE                                   0x1
#define _SLRCON_SLRA_LENGTH                                 0x1
#define _SLRCON_SLRA_MASK                                   0x1
#define _SLRCON_SLRB_POSN                                   0x1
#define _SLRCON_SLRB_POSITION                               0x1
#define _SLRCON_SLRB_SIZE                                   0x1
#define _SLRCON_SLRB_LENGTH                                 0x1
#define _SLRCON_SLRB_MASK                                   0x2
#define _SLRCON_SLRC_POSN                                   0x2
#define _SLRCON_SLRC_POSITION                               0x2
#define _SLRCON_SLRC_SIZE                                   0x1
#define _SLRCON_SLRC_LENGTH                                 0x1
#define _SLRCON_SLRC_MASK                                   0x4

// Register: WPUA
#define WPUA WPUA
extern volatile unsigned char           WPUA                __at(0xF77);
#ifndef _LIB_BUILD
asm("WPUA equ 0F77h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned WPUA3                  :1;
        unsigned WPUA4                  :1;
        unsigned WPUA5                  :1;
    };
} WPUAbits_t;
extern volatile WPUAbits_t WPUAbits __at(0xF77);
// bitfield macros
#define _WPUA_WPUA3_POSN                                    0x3
#define _WPUA_WPUA3_POSITION                                0x3
#define _WPUA_WPUA3_SIZE                                    0x1
#define _WPUA_WPUA3_LENGTH                                  0x1
#define _WPUA_WPUA3_MASK                                    0x8
#define _WPUA_WPUA4_POSN                                    0x4
#define _WPUA_WPUA4_POSITION                                0x4
#define _WPUA_WPUA4_SIZE                                    0x1
#define _WPUA_WPUA4_LENGTH                                  0x1
#define _WPUA_WPUA4_MASK                                    0x10
#define _WPUA_WPUA5_POSN                                    0x5
#define _WPUA_WPUA5_POSITION                                0x5
#define _WPUA_WPUA5_SIZE                                    0x1
#define _WPUA_WPUA5_LENGTH                                  0x1
#define _WPUA_WPUA5_MASK                                    0x20

// Register: WPUB
#define WPUB WPUB
extern volatile unsigned char           WPUB                __at(0xF78);
#ifndef _LIB_BUILD
asm("WPUB equ 0F78h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned WPUB4                  :1;
        unsigned WPUB5                  :1;
        unsigned WPUB6                  :1;
        unsigned WPUB7                  :1;
    };
} WPUBbits_t;
extern volatile WPUBbits_t WPUBbits __at(0xF78);
// bitfield macros
#define _WPUB_WPUB4_POSN                                    0x4
#define _WPUB_WPUB4_POSITION                                0x4
#define _WPUB_WPUB4_SIZE                                    0x1
#define _WPUB_WPUB4_LENGTH                                  0x1
#define _WPUB_WPUB4_MASK                                    0x10
#define _WPUB_WPUB5_POSN                                    0x5
#define _WPUB_WPUB5_POSITION                                0x5
#define _WPUB_WPUB5_SIZE                                    0x1
#define _WPUB_WPUB5_LENGTH                                  0x1
#define _WPUB_WPUB5_MASK                                    0x20
#define _WPUB_WPUB6_POSN                                    0x6
#define _WPUB_WPUB6_POSITION                                0x6
#define _WPUB_WPUB6_SIZE                                    0x1
#define _WPUB_WPUB6_LENGTH                                  0x1
#define _WPUB_WPUB6_MASK                                    0x40
#define _WPUB_WPUB7_POSN                                    0x7
#define _WPUB_WPUB7_POSITION                                0x7
#define _WPUB_WPUB7_SIZE                                    0x1
#define _WPUB_WPUB7_LENGTH                                  0x1
#define _WPUB_WPUB7_MASK                                    0x80

// Register: IOCA
#define IOCA IOCA
extern volatile unsigned char           IOCA                __at(0xF79);
#ifndef _LIB_BUILD
asm("IOCA equ 0F79h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCA0                  :1;
        unsigned IOCA1                  :1;
        unsigned                        :1;
        unsigned IOCA3                  :1;
        unsigned IOCA4                  :1;
        unsigned IOCA5                  :1;
    };
} IOCAbits_t;
extern volatile IOCAbits_t IOCAbits __at(0xF79);
// bitfield macros
#define _IOCA_IOCA0_POSN                                    0x0
#define _IOCA_IOCA0_POSITION                                0x0
#define _IOCA_IOCA0_SIZE                                    0x1
#define _IOCA_IOCA0_LENGTH                                  0x1
#define _IOCA_IOCA0_MASK                                    0x1
#define _IOCA_IOCA1_POSN                                    0x1
#define _IOCA_IOCA1_POSITION                                0x1
#define _IOCA_IOCA1_SIZE                                    0x1
#define _IOCA_IOCA1_LENGTH                                  0x1
#define _IOCA_IOCA1_MASK                                    0x2
#define _IOCA_IOCA3_POSN                                    0x3
#define _IOCA_IOCA3_POSITION                                0x3
#define _IOCA_IOCA3_SIZE                                    0x1
#define _IOCA_IOCA3_LENGTH                                  0x1
#define _IOCA_IOCA3_MASK                                    0x8
#define _IOCA_IOCA4_POSN                                    0x4
#define _IOCA_IOCA4_POSITION                                0x4
#define _IOCA_IOCA4_SIZE                                    0x1
#define _IOCA_IOCA4_LENGTH                                  0x1
#define _IOCA_IOCA4_MASK                                    0x10
#define _IOCA_IOCA5_POSN                                    0x5
#define _IOCA_IOCA5_POSITION                                0x5
#define _IOCA_IOCA5_SIZE                                    0x1
#define _IOCA_IOCA5_LENGTH                                  0x1
#define _IOCA_IOCA5_MASK                                    0x20

