MikroElektronika/core_packages/PIC/XC8/def/PIC18F14K50/mcu.h
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x7DEB);	// @ (0xFBD * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// PORTC<CCP2>
extern volatile __bit                   CCP2                __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 CCP2_bit            _BIT_ACCESS(PORTC,1)
// EECON1<CFGS>
extern volatile __bit                   CFGS                __at(0x7D36);	// @ (0xFA6 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(EECON1,6)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x7E13);	// @ (0xFC2 * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x7E14);	// @ (0xFC2 * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON1<CHSN3>
extern volatile __bit                   CHSN3               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 CHSN3_bit           _BIT_ACCESS(ADCON1,3)
// PORTB<CK>
extern volatile __bit                   CK                  __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 CK_bit              _BIT_ACCESS(PORTB,7)
// SSPSTAT<CKE>
extern volatile __bit                   CKE                 __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSPSTAT,6)
// SSPCON1<CKP>
extern volatile __bit                   CKP                 __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSPCON1,4)
// BAUDCON<CKTXP>
extern volatile __bit                   CKTXP               __at(0x7DC4);	// @ (0xFB8 * 8 + 4)
#define                                 CKTXP_bit           _BIT_ACCESS(BAUDCON,4)
// PORTA<CLKIN>
extern volatile __bit                   CLKIN               __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 CLKIN_bit           _BIT_ACCESS(PORTA,5)
// PORTA<CLKOUT>
extern volatile __bit                   CLKOUT              __at(0x7C04);	// @ (0xF80 * 8 + 4)
#define                                 CLKOUT_bit          _BIT_ACCESS(PORTA,4)
// PIE2<CMIE>
extern volatile __bit                   CMIE                __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 CMIE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<CMIF>
extern volatile __bit                   CMIF                __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 CMIF_bit            _BIT_ACCESS(PIR2,6)
// IPR2<CMIP>
extern volatile __bit                   CMIP                __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 CMIP_bit            _BIT_ACCESS(IPR2,6)
// UEIE<CRC16EE>
extern volatile __bit                   CRC16EE             __at(0x7ADA);	// @ (0xF5B * 8 + 2)
#define                                 CRC16EE_bit         _BIT_ACCESS(UEIE,2)
// UEIR<CRC16EF>
extern volatile __bit                   CRC16EF             __at(0x7AFA);	// @ (0xF5F * 8 + 2)
#define                                 CRC16EF_bit         _BIT_ACCESS(UEIR,2)
// UEIE<CRC5EE>
extern volatile __bit                   CRC5EE              __at(0x7AD9);	// @ (0xF5B * 8 + 1)
#define                                 CRC5EE_bit          _BIT_ACCESS(UEIE,1)
// UEIR<CRC5EF>
extern volatile __bit                   CRC5EF              __at(0x7AF9);	// @ (0xF5F * 8 + 1)
#define                                 CRC5EF_bit          _BIT_ACCESS(UEIR,1)
// RCSTA<CREN>
extern volatile __bit                   CREN                __at(0x7D5C);	// @ (0xFAB * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RCSTA,4)
// TXSTA<CSRC>
extern volatile __bit                   CSRC                __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TXSTA,7)
// TXSTA<CSRC1>
extern volatile __bit                   CSRC1               __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 CSRC1_bit           _BIT_ACCESS(TXSTA,7)
// PORTC<CVREF>
extern volatile __bit                   CVREF               __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 CVREF_bit           _BIT_ACCESS(PORTC,2)
// REFCON1<D1EN>
extern volatile __bit                   D1EN                __at(0x7DDF);	// @ (0xFBB * 8 + 7)
#define                                 D1EN_bit            _BIT_ACCESS(REFCON1,7)
// REFCON1<D1LPS>
extern volatile __bit                   D1LPS               __at(0x7DDE);	// @ (0xFBB * 8 + 6)
#define                                 D1LPS_bit           _BIT_ACCESS(REFCON1,6)
// REFCON1<D1NSS>
extern volatile __bit                   D1NSS               __at(0x7DD8);	// @ (0xFBB * 8 + 0)
#define                                 D1NSS_bit           _BIT_ACCESS(REFCON1,0)
// REFCON1<D1NSS0>
extern volatile __bit                   D1NSS0              __at(0x7DD8);	// @ (0xFBB * 8 + 0)
#define                                 D1NSS0_bit          _BIT_ACCESS(REFCON1,0)
// REFCON1<D1PSS0>
extern volatile __bit                   D1PSS0              __at(0x7DDA);	// @ (0xFBB * 8 + 2)
#define                                 D1PSS0_bit          _BIT_ACCESS(REFCON1,2)
// REFCON1<D1PSS1>
extern volatile __bit                   D1PSS1              __at(0x7DDB);	// @ (0xFBB * 8 + 3)
#define                                 D1PSS1_bit          _BIT_ACCESS(REFCON1,3)
// SSPSTAT<DA>
extern volatile __bit                   DA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA_bit              _BIT_ACCESS(SSPSTAT,5)
// REFCON1<DAC1OE>
extern volatile __bit                   DAC1OE              __at(0x7DDD);	// @ (0xFBB * 8 + 5)
#define                                 DAC1OE_bit          _BIT_ACCESS(REFCON1,5)
// REFCON2<DAC1R0>
extern volatile __bit                   DAC1R0              __at(0x7DE0);	// @ (0xFBC * 8 + 0)
#define                                 DAC1R0_bit          _BIT_ACCESS(REFCON2,0)
// REFCON2<DAC1R1>
extern volatile __bit                   DAC1R1              __at(0x7DE1);	// @ (0xFBC * 8 + 1)
#define                                 DAC1R1_bit          _BIT_ACCESS(REFCON2,1)
// REFCON2<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x7DE2);	// @ (0xFBC * 8 + 2)
#define                                 DAC1R2_bit          _BIT_ACCESS(REFCON2,2)
// REFCON2<DAC1R3>
extern volatile __bit                   DAC1R3              __at(0x7DE3);	// @ (0xFBC * 8 + 3)
#define                                 DAC1R3_bit          _BIT_ACCESS(REFCON2,3)
// REFCON2<DAC1R4>
extern volatile __bit                   DAC1R4              __at(0x7DE4);	// @ (0xFBC * 8 + 4)
#define                                 DAC1R4_bit          _BIT_ACCESS(REFCON2,4)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x7EC1);	// @ (0xFD8 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0x7DEC);	// @ (0xFBD * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0x7DED);	// @ (0xFBD * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// UEIE<DFN8EE>
extern volatile __bit                   DFN8EE              __at(0x7ADB);	// @ (0xF5B * 8 + 3)
#define                                 DFN8EE_bit          _BIT_ACCESS(UEIE,3)
// UEIR<DFN8EF>
extern volatile __bit                   DFN8EF              __at(0x7AFB);	// @ (0xF5F * 8 + 3)
#define                                 DFN8EF_bit          _BIT_ACCESS(UEIR,3)
// USTAT<DIR>
extern volatile __bit                   DIR                 __at(0x7B1A);	// @ (0xF63 * 8 + 2)
#define                                 DIR_bit             _BIT_ACCESS(USTAT,2)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,1)
// PORTB<DT>
extern volatile __bit                   DT                  __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 DT_bit              _BIT_ACCESS(PORTB,5)
// BAUDCON<DTRXP>
extern volatile __bit                   DTRXP               __at(0x7DC5);	// @ (0xFB8 * 8 + 5)
#define                                 DTRXP_bit           _BIT_ACCESS(BAUDCON,5)
// SSPSTAT<D_A>
extern volatile __bit                   D_A                 __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_A_bit             _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<D_NOT_A>
extern volatile __bit                   D_NOT_A             __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_NOT_A_bit         _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<D_nA>
extern volatile __bit                   D_nA                __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSPSTAT,5)
// PR2<EBDIS>
extern volatile __bit                   EBDIS               __at(0x7E5F);	// @ (0xFCB * 8 + 7)
#define                                 EBDIS_bit           _BIT_ACCESS(_PR2,7)  // Note: Changed by MikroE
// ECCP1AS<ECCPAS0>
extern volatile __bit                   ECCPAS0             __at(0x7DB4);	// @ (0xFB6 * 8 + 4)
#define                                 ECCPAS0_bit         _BIT_ACCESS(ECCP1AS,4)
// ECCP1AS<ECCPAS1>
extern volatile __bit                   ECCPAS1             __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 ECCPAS1_bit         _BIT_ACCESS(ECCP1AS,5)
// ECCP1AS<ECCPAS2>
extern volatile __bit                   ECCPAS2             __at(0x7DB6);	// @ (0xFB6 * 8 + 6)
#define                                 ECCPAS2_bit         _BIT_ACCESS(ECCP1AS,6)
// ECCP1AS<ECCPASE>
extern volatile __bit                   ECCPASE             __at(0x7DB7);	// @ (0xFB6 * 8 + 7)
#define                                 ECCPASE_bit         _BIT_ACCESS(ECCP1AS,7)
// EEADR<EEADR0>
extern volatile __bit                   EEADR0              __at(0x7D48);	// @ (0xFA9 * 8 + 0)
#define                                 EEADR0_bit          _BIT_ACCESS(EEADR,0)
// EEADR<EEADR1>
extern volatile __bit                   EEADR1              __at(0x7D49);	// @ (0xFA9 * 8 + 1)
#define                                 EEADR1_bit          _BIT_ACCESS(EEADR,1)
// EEADR<EEADR2>
extern volatile __bit                   EEADR2              __at(0x7D4A);	// @ (0xFA9 * 8 + 2)
#define                                 EEADR2_bit          _BIT_ACCESS(EEADR,2)
// EEADR<EEADR3>
extern volatile __bit                   EEADR3              __at(0x7D4B);	// @ (0xFA9 * 8 + 3)
#define                                 EEADR3_bit          _BIT_ACCESS(EEADR,3)
// EEADR<EEADR4>
extern volatile __bit                   EEADR4              __at(0x7D4C);	// @ (0xFA9 * 8 + 4)
#define                                 EEADR4_bit          _BIT_ACCESS(EEADR,4)
// EEADR<EEADR5>
extern volatile __bit                   EEADR5              __at(0x7D4D);	// @ (0xFA9 * 8 + 5)
#define                                 EEADR5_bit          _BIT_ACCESS(EEADR,5)
// EEADR<EEADR6>
extern volatile __bit                   EEADR6              __at(0x7D4E);	// @ (0xFA9 * 8 + 6)
#define                                 EEADR6_bit          _BIT_ACCESS(EEADR,6)
// EEADR<EEADR7>
extern volatile __bit                   EEADR7              __at(0x7D4F);	// @ (0xFA9 * 8 + 7)
#define                                 EEADR7_bit          _BIT_ACCESS(EEADR,7)
// EECON1<EEFS>
extern volatile __bit                   EEFS                __at(0x7D36);	// @ (0xFA6 * 8 + 6)
#define                                 EEFS_bit            _BIT_ACCESS(EECON1,6)
// PIE2<EEIE>
extern volatile __bit                   EEIE                __at(0x7D04);	// @ (0xFA0 * 8 + 4)
#define                                 EEIE_bit            _BIT_ACCESS(PIE2,4)
// PIR2<EEIF>
extern volatile __bit                   EEIF                __at(0x7D0C);	// @ (0xFA1 * 8 + 4)
#define                                 EEIF_bit            _BIT_ACCESS(PIR2,4)
// IPR2<EEIP>
extern volatile __bit                   EEIP                __at(0x7D14);	// @ (0xFA2 * 8 + 4)
#define                                 EEIP_bit            _BIT_ACCESS(IPR2,4)
// EECON1<EEPGD>
extern volatile __bit                   EEPGD               __at(0x7D37);	// @ (0xFA6 * 8 + 7)
#define                                 EEPGD_bit           _BIT_ACCESS(EECON1,7)
// USTAT<ENDP0>
extern volatile __bit                   ENDP0               __at(0x7B1B);	// @ (0xF63 * 8 + 3)
#define                                 ENDP0_bit           _BIT_ACCESS(USTAT,3)
// USTAT<ENDP1>
extern volatile __bit                   ENDP1               __at(0x7B1C);	// @ (0xF63 * 8 + 4)
#define                                 ENDP1_bit           _BIT_ACCESS(USTAT,4)
// USTAT<ENDP2>
extern volatile __bit                   ENDP2               __at(0x7B1D);	// @ (0xF63 * 8 + 5)
#define                                 ENDP2_bit           _BIT_ACCESS(USTAT,5)
// USTAT<ENDP3>
extern volatile __bit                   ENDP3               __at(0x7B1E);	// @ (0xF63 * 8 + 6)
#define                                 ENDP3_bit           _BIT_ACCESS(USTAT,6)
// UEP0<EP0CONDIS>
extern volatile __bit                   EP0CONDIS           __at(0x7A9B);	// @ (0xF53 * 8 + 3)
#define                                 EP0CONDIS_bit       _BIT_ACCESS(UEP0,3)
// UEP0<EP0HSHK>
extern volatile __bit                   EP0HSHK             __at(0x7A9C);	// @ (0xF53 * 8 + 4)
#define                                 EP0HSHK_bit         _BIT_ACCESS(UEP0,4)
// UEP0<EP0INEN>
extern volatile __bit                   EP0INEN             __at(0x7A99);	// @ (0xF53 * 8 + 1)
#define                                 EP0INEN_bit         _BIT_ACCESS(UEP0,1)
// UEP0<EP0OUTEN>
extern volatile __bit                   EP0OUTEN            __at(0x7A9A);	// @ (0xF53 * 8 + 2)
#define                                 EP0OUTEN_bit        _BIT_ACCESS(UEP0,2)
// UEP0<EP0STALL>
extern volatile __bit                   EP0STALL            __at(0x7A98);	// @ (0xF53 * 8 + 0)
#define                                 EP0STALL_bit        _BIT_ACCESS(UEP0,0)
// UEP1<EP1CONDIS>
extern volatile __bit                   EP1CONDIS           __at(0x7AA3);	// @ (0xF54 * 8 + 3)
#define                                 EP1CONDIS_bit       _BIT_ACCESS(UEP1,3)
// UEP1<EP1HSHK>
extern volatile __bit                   EP1HSHK             __at(0x7AA4);	// @ (0xF54 * 8 + 4)
#define                                 EP1HSHK_bit         _BIT_ACCESS(UEP1,4)
// UEP1<EP1INEN>
extern volatile __bit                   EP1INEN             __at(0x7AA1);	// @ (0xF54 * 8 + 1)
#define                                 EP1INEN_bit         _BIT_ACCESS(UEP1,1)
// UEP1<EP1OUTEN>
extern volatile __bit                   EP1OUTEN            __at(0x7AA2);	// @ (0xF54 * 8 + 2)
#define                                 EP1OUTEN_bit        _BIT_ACCESS(UEP1,2)
// UEP1<EP1STALL>
extern volatile __bit                   EP1STALL            __at(0x7AA0);	// @ (0xF54 * 8 + 0)
#define                                 EP1STALL_bit        _BIT_ACCESS(UEP1,0)
// UEP2<EP2CONDIS>
extern volatile __bit                   EP2CONDIS           __at(0x7AAB);	// @ (0xF55 * 8 + 3)
#define                                 EP2CONDIS_bit       _BIT_ACCESS(UEP2,3)
// UEP2<EP2HSHK>
extern volatile __bit                   EP2HSHK             __at(0x7AAC);	// @ (0xF55 * 8 + 4)
#define                                 EP2HSHK_bit         _BIT_ACCESS(UEP2,4)
// UEP2<EP2INEN>
extern volatile __bit                   EP2INEN             __at(0x7AA9);	// @ (0xF55 * 8 + 1)
#define                                 EP2INEN_bit         _BIT_ACCESS(UEP2,1)
// UEP2<EP2OUTEN>
extern volatile __bit                   EP2OUTEN            __at(0x7AAA);	// @ (0xF55 * 8 + 2)
#define                                 EP2OUTEN_bit        _BIT_ACCESS(UEP2,2)
// UEP2<EP2STALL>
extern volatile __bit                   EP2STALL            __at(0x7AA8);	// @ (0xF55 * 8 + 0)
#define                                 EP2STALL_bit        _BIT_ACCESS(UEP2,0)
// UEP3<EP3CONDIS>
extern volatile __bit                   EP3CONDIS           __at(0x7AB3);	// @ (0xF56 * 8 + 3)
#define                                 EP3CONDIS_bit       _BIT_ACCESS(UEP3,3)
// UEP3<EP3HSHK>
extern volatile __bit                   EP3HSHK             __at(0x7AB4);	// @ (0xF56 * 8 + 4)
#define                                 EP3HSHK_bit         _BIT_ACCESS(UEP3,4)
// UEP3<EP3INEN>
extern volatile __bit                   EP3INEN             __at(0x7AB1);	// @ (0xF56 * 8 + 1)
#define                                 EP3INEN_bit         _BIT_ACCESS(UEP3,1)
// UEP3<EP3OUTEN>
extern volatile __bit                   EP3OUTEN            __at(0x7AB2);	// @ (0xF56 * 8 + 2)
#define                                 EP3OUTEN_bit        _BIT_ACCESS(UEP3,2)
// UEP3<EP3STALL>
extern volatile __bit                   EP3STALL            __at(0x7AB0);	// @ (0xF56 * 8 + 0)
#define                                 EP3STALL_bit        _BIT_ACCESS(UEP3,0)
// UEP4<EP4CONDIS>
extern volatile __bit                   EP4CONDIS           __at(0x7ABB);	// @ (0xF57 * 8 + 3)
#define                                 EP4CONDIS_bit       _BIT_ACCESS(UEP4,3)
// UEP4<EP4HSHK>
extern volatile __bit                   EP4HSHK             __at(0x7ABC);	// @ (0xF57 * 8 + 4)
#define                                 EP4HSHK_bit         _BIT_ACCESS(UEP4,4)
// UEP4<EP4INEN>
extern volatile __bit                   EP4INEN             __at(0x7AB9);	// @ (0xF57 * 8 + 1)
#define                                 EP4INEN_bit         _BIT_ACCESS(UEP4,1)
// UEP4<EP4OUTEN>
extern volatile __bit                   EP4OUTEN            __at(0x7ABA);	// @ (0xF57 * 8 + 2)
#define                                 EP4OUTEN_bit        _BIT_ACCESS(UEP4,2)
// UEP4<EP4STALL>
extern volatile __bit                   EP4STALL            __at(0x7AB8);	// @ (0xF57 * 8 + 0)
#define                                 EP4STALL_bit        _BIT_ACCESS(UEP4,0)
// UEP5<EP5CONDIS>
extern volatile __bit                   EP5CONDIS           __at(0x7AC3);	// @ (0xF58 * 8 + 3)
#define                                 EP5CONDIS_bit       _BIT_ACCESS(UEP5,3)
// UEP5<EP5HSHK>
extern volatile __bit                   EP5HSHK             __at(0x7AC4);	// @ (0xF58 * 8 + 4)
#define                                 EP5HSHK_bit         _BIT_ACCESS(UEP5,4)
// UEP5<EP5INEN>
extern volatile __bit                   EP5INEN             __at(0x7AC1);	// @ (0xF58 * 8 + 1)
#define                                 EP5INEN_bit         _BIT_ACCESS(UEP5,1)
// UEP5<EP5OUTEN>
extern volatile __bit                   EP5OUTEN            __at(0x7AC2);	// @ (0xF58 * 8 + 2)
#define                                 EP5OUTEN_bit        _BIT_ACCESS(UEP5,2)
// UEP5<EP5STALL>
extern volatile __bit                   EP5STALL            __at(0x7AC0);	// @ (0xF58 * 8 + 0)
#define                                 EP5STALL_bit        _BIT_ACCESS(UEP5,0)
// UEP6<EP6CONDIS>
extern volatile __bit                   EP6CONDIS           __at(0x7ACB);	// @ (0xF59 * 8 + 3)
#define                                 EP6CONDIS_bit       _BIT_ACCESS(UEP6,3)
// UEP6<EP6HSHK>
extern volatile __bit                   EP6HSHK             __at(0x7ACC);	// @ (0xF59 * 8 + 4)
#define                                 EP6HSHK_bit         _BIT_ACCESS(UEP6,4)
// UEP6<EP6INEN>
extern volatile __bit                   EP6INEN             __at(0x7AC9);	// @ (0xF59 * 8 + 1)
#define                                 EP6INEN_bit         _BIT_ACCESS(UEP6,1)
// UEP6<EP6OUTEN>
extern volatile __bit                   EP6OUTEN            __at(0x7ACA);	// @ (0xF59 * 8 + 2)
#define                                 EP6OUTEN_bit        _BIT_ACCESS(UEP6,2)
// UEP6<EP6STALL>
extern volatile __bit                   EP6STALL            __at(0x7AC8);	// @ (0xF59 * 8 + 0)
#define                                 EP6STALL_bit        _BIT_ACCESS(UEP6,0)
// UEP7<EP7CONDIS>
extern volatile __bit                   EP7CONDIS           __at(0x7AD3);	// @ (0xF5A * 8 + 3)
#define                                 EP7CONDIS_bit       _BIT_ACCESS(UEP7,3)
// UEP7<EP7HSHK>
extern volatile __bit                   EP7HSHK             __at(0x7AD4);	// @ (0xF5A * 8 + 4)
#define                                 EP7HSHK_bit         _BIT_ACCESS(UEP7,4)
// UEP7<EP7INEN>
extern volatile __bit                   EP7INEN             __at(0x7AD1);	// @ (0xF5A * 8 + 1)
#define                                 EP7INEN_bit         _BIT_ACCESS(UEP7,1)
// UEP7<EP7OUTEN>
extern volatile __bit                   EP7OUTEN            __at(0x7AD2);	// @ (0xF5A * 8 + 2)
#define                                 EP7OUTEN_bit        _BIT_ACCESS(UEP7,2)
// UEP7<EP7STALL>
extern volatile __bit                   EP7STALL            __at(0x7AD0);	// @ (0xF5A * 8 + 0)
#define                                 EP7STALL_bit        _BIT_ACCESS(UEP7,0)
// UEP0<EPCONDIS>
extern volatile __bit _DEPRECATED       EPCONDIS            __at(0x7A9B);	// @ (0xF53 * 8 + 3)
#define                                 EPCONDIS_bit        _BIT_ACCESS(UEP0,3)
// UEP0<EPCONDIS0>
extern volatile __bit                   EPCONDIS0           __at(0x7A9B);	// @ (0xF53 * 8 + 3)
#define                                 EPCONDIS0_bit       _BIT_ACCESS(UEP0,3)
// UEP1<EPCONDIS1>
extern volatile __bit                   EPCONDIS1           __at(0x7AA3);	// @ (0xF54 * 8 + 3)
#define                                 EPCONDIS1_bit       _BIT_ACCESS(UEP1,3)
// UEP2<EPCONDIS2>
extern volatile __bit                   EPCONDIS2           __at(0x7AAB);	// @ (0xF55 * 8 + 3)
#define                                 EPCONDIS2_bit       _BIT_ACCESS(UEP2,3)
// UEP3<EPCONDIS3>
extern volatile __bit                   EPCONDIS3           __at(0x7AB3);	// @ (0xF56 * 8 + 3)
#define                                 EPCONDIS3_bit       _BIT_ACCESS(UEP3,3)
// UEP4<EPCONDIS4>
extern volatile __bit                   EPCONDIS4           __at(0x7ABB);	// @ (0xF57 * 8 + 3)
#define                                 EPCONDIS4_bit       _BIT_ACCESS(UEP4,3)
// UEP5<EPCONDIS5>
extern volatile __bit                   EPCONDIS5           __at(0x7AC3);	// @ (0xF58 * 8 + 3)
#define                                 EPCONDIS5_bit       _BIT_ACCESS(UEP5,3)
// UEP6<EPCONDIS6>
extern volatile __bit                   EPCONDIS6           __at(0x7ACB);	// @ (0xF59 * 8 + 3)
#define                                 EPCONDIS6_bit       _BIT_ACCESS(UEP6,3)
// UEP7<EPCONDIS7>
extern volatile __bit                   EPCONDIS7           __at(0x7AD3);	// @ (0xF5A * 8 + 3)
#define                                 EPCONDIS7_bit       _BIT_ACCESS(UEP7,3)
// UEP0<EPHSHK>
extern volatile __bit _DEPRECATED       EPHSHK              __at(0x7A9C);	// @ (0xF53 * 8 + 4)
#define                                 EPHSHK_bit          _BIT_ACCESS(UEP0,4)
// UEP0<EPHSHK0>
extern volatile __bit                   EPHSHK0             __at(0x7A9C);	// @ (0xF53 * 8 + 4)
#define                                 EPHSHK0_bit         _BIT_ACCESS(UEP0,4)
// UEP1<EPHSHK1>
extern volatile __bit                   EPHSHK1             __at(0x7AA4);	// @ (0xF54 * 8 + 4)
